INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(1,'1000','김우석', '1234@naver.com', '1000', '영문과', '1', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(2,'1001','서승범', '1235@naver.com', '1001', '영문과', '2', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(3,'1002','차혜린', '1236@naver.com', '1002', '영문과', '3', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(4,'1003','조석현', '1237@naver.com', '1003', '영문과', '4', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(5,'1004','이지현', '1238@naver.com', '1004', '영문과', '석사', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(6,'1005','주성현', '1239@naver.com', '1005', '영문과', '박사', 'STUDENT');

INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(7,'2000','서우석', '2234@naver.com', '2000', '컴퓨터공학과', '1', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(8,'2001','김승범', '2235@naver.com', '2001', '컴퓨터공학과', '2', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(9,'2002','조혜린', '2236@naver.com', '2002', '컴퓨터공학과', '3', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(10,'2003','차석현', '2237@naver.com', '2003', '컴퓨터공학과', '4', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(11,'2004','주지현', '2238@naver.com', '2004', '컴퓨터공학과', '석사', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(12,'2005','이성현', '2239@naver.com', '2005', '컴퓨터공학과', '박사', 'STUDENT');

INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(13,'3000','주우석', '3234@naver.com', '3000', '디자인학과', '1', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(14,'3001','차승범', '3235@naver.com', '3001', '디자인학과', '2', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(15,'3002','이혜린', '3236@naver.com', '3002', '디자인학과', '3', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(16,'3003','주석현', '3237@naver.com', '3003', '디자인학과', '4', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(17,'3004','김지현', '3238@naver.com', '3004', '디자인학과', '석사', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(18,'3005','서성현', '3239@naver.com', '3005', '디자인학과', '박사', 'STUDENT');

INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(19,'4000','차우석', '4234@naver.com', '4000', '교양학부', '1', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(20,'4001','조승범', '4235@naver.com', '4001', '교양학부', '2', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(21,'4002','주혜린', '4236@naver.com', '4002', '교양학부', '3', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(22,'4003','이석현', '4237@naver.com', '4003', '교양학부', '4', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(23,'4004','서지현', '4238@naver.com', '4004', '교양학부', '석사', 'STUDENT');
INSERT INTO STUDENT(id, studentNumber, name, email, password, major, grade, role) VALUES(24,'4005','김성현', '4239@naver.com', '4005', '교양학부', '박사', 'STUDENT');


INSERT INTO ADMIN(id, studentNumber, password, role) VALUES(1,'admin','admin', 'ADMIN');

INSERT INTO SUBJECT(id, courseType, department, grade, subjectCode, subjectName, professor, weekday, startTime, endTime, credit, capacity, plan)
VALUES
(1,'전공(선택)', '컴퓨터공학과', '1', 'CS101', 'AI 개론', '박세진', '월', '15:00', '16:50', 3, 30, '인공지능 기본 개념 학습'),
(2,'전공(선택)', '컴퓨터공학과', '1', 'CS102', '프로그래밍 기초', '김철수', '화', '13:00', '14:50', 2, 30, '기초 프로그래밍 교육'),
(3,'전공(필수)', '컴퓨터공학과', '1', 'CS103', '자료구조', '정하늘', '화', '15:00', '16:50', 2, 35, '자료구조 이해'),
(4,'전공(필수)', '컴퓨터공학과', '1', 'CS104', '컴퓨터개론', '문성훈', '화', '09:00', '10:50', 2, 20, '컴퓨터 전반 소개'),
(5,'전공(선택)', '컴퓨터공학과', '1', 'CS105', '알고리즘', '최수빈', '화', '11:00', '12:50', 2, 30, '알고리즘 설계 및 분석'),
(6,'전공(필수)', '컴퓨터공학과', '2', 'CS201', 'AI 개론', '서지훈', '목', '13:00', '14:50', 3, 25, '인공지능 기본 개념 학습'),
(7,'전공(필수)', '컴퓨터공학과', '2', 'CS202', '알고리즘', '문성훈', '화', '15:00', '16:50', 3, 20, '알고리즘 설계 및 분석'),
(8,'전공(선택)', '컴퓨터공학과', '2', 'CS203', '캡스톤디자인', '박예린', '수', '09:00', '10:50', 3, 35, '문제 해결 프로젝트 수행'),
(9,'전공(선택)', '컴퓨터공학과', '2', 'CS204', '데이터베이스', '정다은', '수', '15:00', '16:50', 3, 30, 'SQL과 DB 이해'),
(10,'전공(선택)', '컴퓨터공학과', '2', 'CS205', '컴퓨터네트워크', '이현우', '월', '11:00', '12:50', 3, 35, '네트워크 계층과 TCP/IP'),
(11,'전공(필수)', '컴퓨터공학과', '3', 'CS301', '컴퓨터네트워크', '김철수', '수', '11:00', '12:50', 2, 30, '네트워크 계층과 TCP/IP'),
(12,'전공(필수)', '컴퓨터공학과', '3', 'CS302', '데이터베이스', '박세진', '금', '09:00', '10:50', 2, 30, 'SQL과 DB 이해'),
(13,'전공(필수)', '컴퓨터공학과', '3', 'CS303', '캡스톤디자인', '강윤서', '금', '11:00', '12:50', 3, 35, '문제 해결 프로젝트 수행'),
(14,'전공(선택)', '컴퓨터공학과', '3', 'CS304', 'AI 개론', '이서윤', '목', '15:00', '16:50', 2, 20, '인공지능 기본 개념 학습'),
(15,'전공(선택)', '컴퓨터공학과', '3', 'CS305', '운영체제', '최수빈', '수', '13:00', '14:50', 2, 30, '운영체제 구조 및 역할'),
(16,'전공(선택)', '컴퓨터공학과', '4', 'CS401', '컴퓨터네트워크', '김지우', '월', '09:00', '10:50', 2, 20, '네트워크 계층과 TCP/IP'),
(17,'전공(필수)', '컴퓨터공학과', '4', 'CS402', '자료구조', '김지우', '목', '15:00', '16:50', 3, 20, '자료구조 이해'),
(18,'전공(선택)', '컴퓨터공학과', '4', 'CS403', '운영체제', '박예린', '목', '09:00', '10:50', 2, 25, '운영체제 구조 및 역할'),
(19,'전공(필수)', '컴퓨터공학과', '4', 'CS404', '알고리즘', '김지우', '월', '13:00', '14:50', 2, 25, '알고리즘 설계 및 분석'),
(20,'전공(필수)', '컴퓨터공학과', '4', 'CS405', 'AI 개론', '최정민', '수', '13:00', '14:50', 3, 30, '인공지능 기본 개념 학습'),
(21,'전공(선택)', '컴퓨터공학과', '석사', 'CSM01', '컴파일러', '박세진', '수', '09:00', '10:50', 2, 25, '컴파일러 구조 및 원리'),
(22,'전공(선택)', '컴퓨터공학과', '석사', 'CSM02', '알고리즘', '김하은', '금', '09:00', '10:50', 2, 35, '알고리즘 설계 및 분석'),
(23,'전공(필수)', '컴퓨터공학과', '석사', 'CSM03', '데이터베이스', '서지훈', '목', '09:00', '10:50', 3, 25, 'SQL과 DB 이해'),
(24,'전공(선택)', '컴퓨터공학과', '석사', 'CSM04', 'AI 개론', '최정민', '목', '09:00', '10:50', 2, 20, '인공지능 기본 개념 학습'),
(25,'전공(필수)', '컴퓨터공학과', '석사', 'CSM05', '컴퓨터네트워크', '문성훈', '금', '15:00', '16:50', 3, 25, '네트워크 계층과 TCP/IP'),
(26,'전공(필수)', '컴퓨터공학과', '박사', 'CSD01', '데이터베이스', '최수빈', '월', '13:00', '14:50', 3, 25, 'SQL과 DB 이해'),
(27,'전공(선택)', '컴퓨터공학과', '박사', 'CSD02', '운영체제', '박세진', '화', '13:00', '14:50', 2, 35, '운영체제 구조 및 역할'),
(28,'전공(선택)', '컴퓨터공학과', '박사', 'CSD03', '캡스톤디자인', '이서윤', '목', '15:00', '16:50', 3, 25, '문제 해결 프로젝트 수행'),
(29,'전공(필수)', '컴퓨터공학과', '박사', 'CSD04', '프로그래밍 기초', '강윤서', '화', '09:00', '10:50', 2, 20, '기초 프로그래밍 교육'),
(30,'전공(필수)', '컴퓨터공학과', '박사', 'CSD05', '자료구조', '김하은', '월', '15:00', '16:50', 3, 30, '자료구조 이해'),
(31,'전공(선택)', '디자인학과', '1', 'DS101', '시각디자인', '최수빈', '목', '09:00', '10:50', 3, 20, '시각 표현 기법 습득'),
(32,'전공(필수)', '디자인학과', '1', 'DS102', 'UX디자인', '박예린', '금', '09:00', '10:50', 2, 35, '사용자 경험 설계 이론과 실습'),
(33,'전공(필수)', '디자인학과', '1', 'DS103', '브랜드디자인', '김철수', '월', '15:00', '16:50', 3, 20, '브랜딩과 아이덴티티 설계'),
(34,'전공(선택)', '디자인학과', '1', 'DS104', '웹디자인', '한지민', '금', '11:00', '12:50', 2, 20, '웹 UI/UX 설계 및 구현'),
(35,'전공(선택)', '디자인학과', '1', 'DS105', '디자인 이론', '박예린', '월', '09:00', '10:50', 2, 35, '디자인 사조와 역사'),
(36,'전공(필수)', '디자인학과', '2', 'DS201', '색채학', '이서윤', '목', '11:00', '12:50', 3, 35, '색채 이론 및 활용'),
(37,'전공(선택)', '디자인학과', '2', 'DS202', '디자인 이론', '김하은', '목', '13:00', '14:50', 3, 30, '디자인 사조와 역사'),
(38,'전공(선택)', '디자인학과', '2', 'DS203', '디자인 포트폴리오', '최수빈', '화', '09:00', '10:50', 2, 30, '작품 발표 및 포트폴리오 구성'),
(39,'전공(필수)', '디자인학과', '2', 'DS204', '브랜드디자인', '김철수', '목', '15:00', '16:50', 2, 30, '브랜딩과 아이덴티티 설계'),
(40,'전공(필수)', '디자인학과', '2', 'DS205', '디자인 리서치', '서지훈', '월', '09:00', '10:50', 3, 35, '사용자 조사 방법론'),
(41,'전공(필수)', '디자인학과', '3', 'DS301', 'UX디자인', '최수빈', '목', '09:00', '10:50', 2, 25, '사용자 경험 설계 이론과 실습'),
(42,'전공(선택)', '디자인학과', '3', 'DS302', '웹디자인', '강윤서', '금', '13:00', '14:50', 2, 35, '웹 UI/UX 설계 및 구현'),
(43,'전공(필수)', '디자인학과', '3', 'DS303', '디자인 이론', '박예린', '수', '13:00', '14:50', 2, 30, '디자인 사조와 역사'),
(44,'전공(필수)', '디자인학과', '3', 'DS304', '3D디자인', '김철수', '월', '09:00', '10:50', 2, 30, '3D 디자인 툴 실습'),
(45,'전공(선택)', '디자인학과', '3', 'DS305', '브랜드디자인', '강윤서', '목', '11:00', '12:50', 2, 25, '브랜딩과 아이덴티티 설계'),
(46,'전공(필수)', '디자인학과', '4', 'DS401', '웹디자인', '홍서준', '목', '13:00', '14:50', 2, 20, '웹 UI/UX 설계 및 구현'),
(47,'전공(필수)', '디자인학과', '4', 'DS402', '색채학', '한지원', '월', '09:00', '10:50', 2, 20, '색채 이론 및 활용'),
(48,'전공(필수)', '디자인학과', '4', 'DS403', '브랜드디자인', '서지훈', '목', '15:00', '16:50', 3, 35, '브랜딩과 아이덴티티 설계'),
(49,'전공(선택)', '디자인학과', '4', 'DS404', '디자인 포트폴리오', '서지훈', '금', '15:00', '16:50', 2, 25, '작품 발표 및 포트폴리오 구성'),
(50,'전공(필수)', '디자인학과', '4', 'DS405', '시각디자인', '이현우', '목', '11:00', '12:50', 2, 30, '시각 표현 기법 습득'),
(51,'전공(필수)', '디자인학과', '석사', 'DSM01', '디자인 리서치', '강윤서', '수', '09:00', '10:50', 3, 30, '사용자 조사 방법론'),
(52,'전공(필수)', '디자인학과', '석사', 'DSM02', '브랜드디자인', '최정민', '월', '13:00', '14:50', 2, 20, '브랜딩과 아이덴티티 설계'),
(53,'전공(선택)', '디자인학과', '석사', 'DSM03', '디자인 포트폴리오', '김지우', '금', '15:00', '16:50', 2, 25, '작품 발표 및 포트폴리오 구성'),
(54,'전공(필수)', '디자인학과', '석사', 'DSM04', '디자인 이론', '문성훈', '수', '09:00', '10:50', 3, 20, '디자인 사조와 역사'),
(55,'전공(선택)', '디자인학과', '석사', 'DSM05', 'UX디자인', '문성훈', '금', '15:00', '16:50', 2, 35, '사용자 경험 설계 이론과 실습'),
(56,'전공(선택)', '디자인학과', '박사', 'DSD01', '시각디자인', '최수빈', '목', '09:00', '10:50', 3, 30, '시각 표현 기법 습득'),
(57,'전공(선택)', '디자인학과', '박사', 'DSD02', '웹디자인', '박세진', '화', '11:00', '12:50', 2, 30, '웹 UI/UX 설계 및 구현'),
(58,'전공(필수)', '디자인학과', '박사', 'DSD03', '디자인 포트폴리오', '정하늘', '화', '15:00', '16:50', 2, 25, '작품 발표 및 포트폴리오 구성'),
(59,'전공(선택)', '디자인학과', '박사', 'DSD04', '디자인 리서치', '정하늘', '금', '11:00', '12:50', 3, 20, '사용자 조사 방법론'),
(60,'전공(선택)', '디자인학과', '박사', 'DSD05', '색채학', '박민준', '목', '15:00', '16:50', 3, 25, '색채 이론 및 활용'),
(61,'전공(선택)', '영어영문학과', '1', 'EN101', '영문독해', '이서윤', '월', '13:00', '14:50', 2, 30, '복합 문장 독해'),
(62,'전공(필수)', '영어영문학과', '1', 'EN102', '영문학개론', '한지원', '금', '13:00', '14:50', 3, 30, '문학 장르 소개'),
(63,'전공(선택)', '영어영문학과', '1', 'EN103', '영어발음연습', '박세진', '수', '13:00', '14:50', 3, 20, '발음과 억양 교정'),
(64,'전공(필수)', '영어영문학과', '1', 'EN104', '영어회화', '홍서준', '수', '11:00', '12:50', 2, 35, '실생활 영어회화'),
(65,'전공(선택)', '영어영문학과', '1', 'EN105', '영문법', '정다은', '수', '11:00', '12:50', 3, 25, '기초 문법 학습'),
(66,'전공(선택)', '영어영문학과', '2', 'EN201', '영문법', '한지민', '수', '09:00', '10:50', 2, 35, '기초 문법 학습'),
(67,'전공(선택)', '영어영문학과', '2', 'EN202', '영어회화', '이영희', '금', '15:00', '16:50', 2, 30, '실생활 영어회화'),
(68,'전공(필수)', '영어영문학과', '2', 'EN203', '영미문학', '김철수', '월', '09:00', '10:50', 3, 35, '영미 문학 작품 읽기'),
(69,'전공(필수)', '영어영문학과', '2', 'EN204', '영작문', '문성훈', '금', '09:00', '10:50', 3, 30, '영문 글쓰기 실습'),
(70,'전공(필수)', '영어영문학과', '2', 'EN205', '영어발표', '이서윤', '금', '15:00', '16:50', 3, 25, '프레젠테이션 능력 향상'),
(71,'전공(선택)', '영어영문학과', '3', 'EN301', '문학비평', '김지우', '화', '13:00', '14:50', 3, 35, '문학 이론과 비평'),
(72,'전공(필수)', '영어영문학과', '3', 'EN302', '영어발표', '정다은', '월', '13:00', '14:50', 3, 20, '프레젠테이션 능력 향상'),
(73,'전공(선택)', '영어영문학과', '3', 'EN303', '영미문학', '최수빈', '수', '13:00', '14:50', 3, 25, '영미 문학 작품 읽기'),
(74,'전공(필수)', '영어영문학과', '3', 'EN304', '영문독해', '윤다현', '금', '13:00', '14:50', 3, 20, '복합 문장 독해'),
(75,'전공(선택)', '영어영문학과', '3', 'EN305', '영문법', '정하늘', '수', '11:00', '12:50', 2, 30, '기초 문법 학습'),
(76,'전공(필수)', '영어영문학과', '4', 'EN401', '문학비평', '이현우', '월', '15:00', '16:50', 3, 30, '문학 이론과 비평'),
(77,'전공(선택)', '영어영문학과', '4', 'EN402', '영어발음연습', '최정민', '금', '15:00', '16:50', 3, 20, '발음과 억양 교정'),
(78,'전공(필수)', '영어영문학과', '4', 'EN403', '영문법', '정다은', '화', '15:00', '16:50', 3, 35, '기초 문법 학습'),
(79,'전공(선택)', '영어영문학과', '4', 'EN404', '영어회화', '박세진', '목', '09:00', '10:50', 2, 35, '실생활 영어회화'),
(80,'전공(선택)', '영어영문학과', '4', 'EN405', '영작문', '박예린', '월', '13:00', '14:50', 2, 20, '영문 글쓰기 실습'),
(81,'전공(필수)', '영어영문학과', '석사', 'ENM01', '미국문화', '한지민', '목', '09:00', '10:50', 3, 30, '미국의 역사와 문화 탐구'),
(82,'전공(필수)', '영어영문학과', '석사', 'ENM02', '영문법', '김철수', '목', '11:00', '12:50', 3, 35, '기초 문법 학습'),
(83,'전공(필수)', '영어영문학과', '석사', 'ENM03', '영어회화', '정하늘', '수', '13:00', '14:50', 3, 35, '실생활 영어회화'),
(84,'전공(선택)', '영어영문학과', '석사', 'ENM04', '영어발음연습', '문성훈', '목', '09:00', '10:50', 2, 30, '발음과 억양 교정'),
(85,'전공(선택)', '영어영문학과', '석사', 'ENM05', '영문학개론', '김하은', '화', '15:00', '16:50', 3, 20, '문학 장르 소개'),
(86,'전공(필수)', '영어영문학과', '박사', 'END01', '영어회화', '한지민', '금', '13:00', '14:50', 2, 35, '실생활 영어회화'),
(87,'전공(선택)', '영어영문학과', '박사', 'END02', '미국문화', '윤다현', '화', '13:00', '14:50', 2, 20, '미국의 역사와 문화 탐구'),
(88,'전공(선택)', '영어영문학과', '박사', 'END03', '영어발표', '이영희', '금', '13:00', '14:50', 3, 35, '프레젠테이션 능력 향상'),
(89,'전공(선택)', '영어영문학과', '박사', 'END04', '영문학개론', '김지우', '화', '15:00', '16:50', 2, 30, '문학 장르 소개'),
(90,'전공(선택)', '영어영문학과', '박사', 'END05', '영미문학', '강윤서', '화', '11:00', '12:50', 3, 20, '영미 문학 작품 읽기'),
(91,'교양(선택)', '교양학부', '1', 'GE101', '세계사', '홍서준', '수', '11:00', '12:50', 2, 35, '역사적 흐름 이해'),
(92,'교양(필수)', '교양학부', '1', 'GE102', '경제의 이해', '한지민', '수', '15:00', '16:50', 3, 30, '경제 원리 소개'),
(93,'교양(필수)', '교양학부', '1', 'GE103', '논리와 사고', '김지우', '월', '11:00', '12:50', 3, 20, '논리적 사고력 증진'),
(94,'교양(필수)', '교양학부', '1', 'GE104', '자기개발', '한지민', '수', '09:00', '10:50', 3, 35, '목표 설정과 진로 탐색'),
(95,'교양(필수)', '교양학부', '1', 'GE105', '리더십', '박예린', '목', '15:00', '16:50', 2, 25, '조직과 커뮤니케이션'),
(96,'교양(선택)', '교양학부', '2', 'GE201', '논리와 사고', '윤다현', '수', '15:00', '16:50', 2, 20, '논리적 사고력 증진'),
(97,'교양(선택)', '교양학부', '2', 'GE202', '환경과 인간', '한지원', '화', '11:00', '12:50', 2, 25, '지속가능성과 환경문제'),
(98,'교양(필수)', '교양학부', '2', 'GE203', '글쓰기', '윤다현', '금', '09:00', '10:50', 2, 30, '글쓰기 능력 향상'),
(99,'교양(필수)', '교양학부', '2', 'GE204', 'AI와 미래사회', '이현우', '금', '11:00', '12:50', 2, 30, '4차 산업혁명 이해'),
(100,'교양(필수)', '교양학부', '2', 'GE205', '리더십', '김지우', '화', '15:00', '16:50', 2, 20, '조직과 커뮤니케이션'),
(101,'교양(선택)', '교양학부', '3', 'GE301', '철학의 이해', '최수빈', '수', '11:00', '12:50', 2, 35, '철학 개념과 사상가 소개'),
(102,'교양(선택)', '교양학부', '3', 'GE302', '자기개발', '최정민', '금', '13:00', '14:50', 2, 35, '목표 설정과 진로 탐색'),
(103,'교양(선택)', '교양학부', '3', 'GE303', '환경과 인간', '한지민', '목', '15:00', '16:50', 2, 20, '지속가능성과 환경문제'),
(104,'교양(필수)', '교양학부', '3', 'GE304', 'AI와 미래사회', '정다은', '수', '13:00', '14:50', 3, 35, '4차 산업혁명 이해'),
(105,'교양(선택)', '교양학부', '3', 'GE305', '리더십', '정다은', '목', '11:00', '12:50', 3, 35, '조직과 커뮤니케이션'),
(106,'교양(선택)', '교양학부', '4', 'GE401', 'AI와 미래사회', '김하은', '목', '13:00', '14:50', 3, 30, '4차 산업혁명 이해'),
(107,'교양(선택)', '교양학부', '4', 'GE402', '세계사', '한지민', '화', '09:00', '10:50', 2, 25, '역사적 흐름 이해'),
(108,'교양(선택)', '교양학부', '4', 'GE403', '논리와 사고', '강윤서', '수', '11:00', '12:50', 2, 35, '논리적 사고력 증진'),
(109,'교양(선택)', '교양학부', '4', 'GE404', '철학의 이해', '이영희', '수', '11:00', '12:50', 3, 30, '철학 개념과 사상가 소개'),
(110,'교양(필수)', '교양학부', '4', 'GE405', '글쓰기', '박민준', '화', '11:00', '12:50', 3, 30, '글쓰기 능력 향상'),
(111,'교양(선택)', '교양학부', '석사', 'GEM01', '환경과 인간', '김지우', '금', '15:00', '16:50', 3, 20, '지속가능성과 환경문제'),
(112,'교양(필수)', '교양학부', '석사', 'GEM02', '한국문화', '강윤서', '화', '13:00', '14:50', 3, 30, '한국의 전통과 현대문화'),
(113,'교양(선택)', '교양학부', '석사', 'GEM03', '철학의 이해', '서지훈', '금', '09:00', '10:50', 3, 25, '철학 개념과 사상가 소개'),
(114,'교양(필수)', '교양학부', '석사', 'GEM04', '자기개발', '최수빈', '목', '09:00', '10:50', 3, 25, '목표 설정과 진로 탐색'),
(115,'교양(필수)', '교양학부', '석사', 'GEM05', '세계사', '정하늘', '월', '15:00', '16:50', 3, 30, '역사적 흐름 이해'),
(116,'교양(필수)', '교양학부', '박사', 'GED01', '경제의 이해', '최수빈', '월', '11:00', '12:50', 3, 25, '경제 원리 소개'),
(117,'교양(필수)', '교양학부', '박사', 'GED02', '글쓰기', '김철수', '목', '15:00', '16:50', 2, 25, '글쓰기 능력 향상'),
(118,'교양(필수)', '교양학부', '박사', 'GED03', '환경과 인간', '최정민', '금', '09:00', '10:50', 2, 25, '지속가능성과 환경문제'),
(119,'교양(필수)', '교양학부', '박사', 'GED04', '세계사', '김철수', '금', '13:00', '14:50', 2, 30, '역사적 흐름 이해'),
(120,'교양(선택)', '교양학부', '박사', 'GED05', '철학의 이해', '문성훈', '월', '09:00', '10:50', 3, 30, '철학 개념과 사상가 소개');
